HELYXcore-4.4.0/examples/legacy/lagrangian/MPPICFoam/column/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-9.2 -9.2   0)
    ( 9.2 -9.2   0)
    ( 9.2  9.2   0)
    (-9.2  9.2   0)
    (-9.2 -9.2 300)
    ( 9.2 -9.2 300)
    ( 9.2  9.2 300)
    (-9.2  9.2 300)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }

    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);

// ************************************************************************* //
